def til():
    tili = int(input("""
   ВЫБОР ЯЗЫКА =>                1. РУССКИЙ
   TILNI TANLANG =>              2. O'ZBEK
   LANGUAGE SELECTION =>         3. ENGLISH

   =>>  """))
    if tili == 1:
        rus()
    elif tili == 2:
        uzbek()

    elif tili == 3:
        english()


def uzbek():
    kodi = 9699
    popitok = 3

    while popitok > 0:
        card = int(input("PIN KODNI KIRITING =>> "))
        if card == kodi:
            uzjarayon()

        popitok -= 1

    print("SIZ 3 MAROTABA NOTO'G'RI PIN KOD KIRITDINGIZ!")
    print("SHU SABABDAN KARTAGIZ BLOKLANDI!")
    print("_____________________________________________________________________________________________")
    til()


def rus():
    kodi = 9699
    popitok = 2
    while popitok > 0:
        card = int(input("ВВЕДИТЕ ПИН-КОД =>> "))
        if card == kodi:
            rusjarayon()

        popitok -= 1

    print("ВЫ ВВЕДИЛИ НЕПРАВИЛЬНЫЙ ПИН-КОД 3 РАЗА!")
    print("ПОЭТОМУ ВАША КАРТА БЛОКИРУЕТСЯ!")
    print("_____________________________________________________________________________________________")
    til()


def english():
    kodi = 9699
    popitok = 2
    while popitok > 0:
        card = int(input("ENTER PIN CODE =>> "))
        if card == kodi:
            enjarayon()

        popitok -= 1

    print("YOU ENTERED THE WRONG PI CODE 3 TIMES!")
    print("THIS IS WHY YOUR CARD IS BLOCKED!")
    print("_____________________________________________________________________________________________")
    til()


def uzjarayon():
    pin = int(input("""XIZMAT TURINI TANLANG:
         ______________________     _____________________ 
        | 1.PIN O'ZGARTIRISH   |   |   3.KARTA BALANSI   |
         ----------------------     ---------------------
   
         ______________________     _____________________
        | 2.PIN BLOKDAN OCHISH |   |  4.NAQD PUL OLISH   |
         ----------------------     ---------------------


                                    _____________________
                                   | 0.KARTANI CHIQARISH |
                                    ---------------------
                               
                                    TANLANG => """))
    if pin == 0:
        til()
    elif pin == 1:
        pinozgart()
    elif pin == 2:
        pinochish()
    elif pin == 3:
        kartahisob()
    elif pin == 4:
        naqdpul()


def rusjarayon():
    pin = int(input("""ВЫБЕРИТЕ ВИД УСЛУГИ:
         ______________________     ________________________________
        | 1. ИЗМЕНИТЬ PIN-код  |   |        3. БАЛАНС КАРТЫ         |
         ----------------------     --------------------------------

         ______________________     ________________________________
        | 2.ОТКРЫТИЕ ПИН-БЛОКА |   |  4. ПОЛУЧЕНИЕ НАЛИЧНЫХ СРЕДСТВ |
         ----------------------     --------------------------------


                                    ________________________________
                                   |        0. ВЫДАЧА КАРТЫ         |
                                    --------------------------------

                                    ВЫБЕРИТЕ => """))
    if pin == 0:
        til()
    elif pin == 1:
        pinizmeni()
    elif pin == 2:
        pinotkrit()
    elif pin == 3:
        kartabalans()
    elif pin == 4:
        naqddengi()


def enjarayon():
    pin = int(input("""SELECT TYPE OF SERVICE:
         ______________________     ________________________________
        |  1. CHANGE PIN code  |   |        3. CARD BALANCE         |
         ----------------------     --------------------------------

         ______________________     ________________________________
        |  2.OPENING PIN BLOCK |   |       4. RECEIVING CASH        |
         ----------------------     --------------------------------


                                    ________________________________
                                   |      0. ISSUANCE OF CARD       |
                                    --------------------------------

                                    SELECT =>  """))

    if pin == 0:
        til()
    elif pin == 1:
        pinedit()
    elif pin == 2:
        pinopen()
    elif pin == 3:
        kartabalance()
    elif pin == 4:
        naqdmoney()

############################### PIN O'ZGARTIRISH FUNKSIYASI  ###########################################
def pinozgart():
    urunish = 10
    while urunish >= 0:
        yangipin = int(input("""YANGI PIN KOD KIRITING =>>
         ____________________________________             ________________
        |------------------------------------            | 0.BEKOR QILISH |
        |------------------------------------             ----------------
        |YANGI PIN KOD =>>    """))

        if 999 <= yangipin <= 10000:
            kodi = yangipin
            ozgartpin()
        elif yangipin == 0:
            uzjarayon()

def pinizmeni():
    urunish = 10
    while urunish >= 0:
        yangipin = int(input("""ВВЕДИТЕ НОВЫЙ ПИН-код =>>
         ____________________________________             __________
        |                                                | 0.ОТМЕНА |
        |                                                 ----------
        |НОВЫЙ ПИН-код =>>    """))

        if  999 <= yangipin <= 10000:
            kodi = yangipin
            izmenpin()
        elif yangipin == 0:
            rusjarayon()




def pinedit():
    urunish = 10
    while urunish >= 0:
        yangipin = int(input("""ENTER NEW PIN CODE =>>
         ____________________________________             __________
        |------------------------------------            | 0.CANCEl |
        |------------------------------------             ----------
        |ENTER NEW PIN CODE =>>    """))

        if 999 <= yangipin <= 10000:
            kodi = yangipin
            editpin()
        elif yangipin == 0:
            enjarayon()

def izmenpin():
    orqaga = 15
    while orqaga > 0:
        ozgart = int(input("""  
         __________________________            _________
        | ПИН-КОД УСПЕШНО ИЗМЕНЕН! |          | 0.НАЗАД |
         --------------------------            ---------
        ВВЕДИТЕ =>> """))

        if ozgart == 0:
            rusjarayon()
        orqaga -= 1
        rusjarayon()

def ozgartpin():
    orqaga = 15
    while orqaga > 0:
        ozgart = int(input("""  
         _______________________________________            __________
        | PIN KOD MUVAFFAQQIYATLI OZGARTIRILDI! |          | 0.ORQAGA |
         ---------------------------------------            ----------
        KIRITING =>> """))

        if ozgart == 0:
            uzjarayon()
        orqaga -= 1
        uzjarayon()

def editpin():
    orqaga = 15
    while orqaga > 0:
        ozgart = int(input("""  
         _______________________________            ________
        | PIN CODE CHANGED SUCCESSFULLY |          | 0.BACK |
         -------------------------------            --------
        ENTER =>> """))

        if ozgart == 0:
            enjarayon()
        orqaga -= 1
        enjarayon()

###########################KARTANI BLOKDAN OCHISH UCHUN FUNKSIYALAR###########################
def pinochish():
    pinoch = int(input("""
         ____________________          ________________          _____________________   
        | 1.AMALGA OSHIRISH  |        | 2.BEKOR QILISH |        | 0.KARTANI CHIQARISH |
         --------------------          ----------------          ---------------------
    =>> """))
    if pinoch == 1:
        pinochilgan()

def pinotkrit():
    pinoch = int(input("""
         ______________          __________          ________________   
        | 1.СДЕЛАЙ ЭТО |        | 2.ОТМЕНА |        | 0.ВЫДАЧА КАРТЫ |
         --------------          ----------          ----------------
        =>> """))
    if pinoch == 1:
        pinotkrito()
    elif pinoch == 2:
        rusjarayon()
def pinopen():
    pinoch = int(input("""
         __________________          __________          ____________________   
        | 1.MAKE IT HAPPEN |        | 2.CANCEL |        | 0.ISSUANCE OF CARD |
         ------------------          ----------          --------------------
        =>> """))
    if pinoch == 1:
        pinopened()
    elif pinoch == 2:
        enjarayon()
    elif pinoch == 0:
        til()
    else:
        print("ERROR!")
        enjarayon()

############################BLOKDAN OCHILGANDAN KEYINGI HOLAT#####################################
def pinochilgan():
    pinoch = int(input("""
         _________________________           __________           _____________________
        | KARTA BLOKLDAN OCHILDI! |         | 0.ORQAGA |         | 1.KARTANI CHIQARISH |
         -------------------------           ----------           ---------------------
        KIRITING =>> """))
    if pinoch == 0:
        uzjarayon()
    elif pinoch == 1:
        til()
    else:
        pinochilgan()

def pinotkrito():
    pinoch = int(input("""
         _______________________           _________           ________________
        | КАРТА РАЗБЛОКИРОВАНА! |         | 0.НАЗАД |         | 1.ВЫДАЧА КАРТЫ |
         -----------------------           ---------           ----------------
        ВВЕДИТЕ =>> """))
    if pinoch == 0:
        rusjarayon()
    elif pinoch == 1:
        til()
    else:
        pinotkrito()

def pinopened():
    pinoch = int(input("""
         ________________           ________           ____________________
        | CARD UNLOCKED! |         | 0.BACK |         | 1.ISSUANCE OF CARD |
         ----------------           --------           --------------------
        ENTER =>>   """))
    if pinoch == 0:
        enjarayon()
    elif pinoch == 1:
        til()
    else:
        pinopened()

##############################BALANSI BOYICHAA####################################

def kartahisob():
    hisob = 10000000

    print(f"SIZNING HISOBINGIZDA {hisob} SO'M MAVJUD!'")
    hisobchiqish()

def kartabalans():
    hisob = 10000000

    print(f"НА ВАШЕМ СЧЕТЕ {hisob} СУМ В НАЛИЧИИ!'")
    balanschiqish()

def kartabalance():
    hisob = 10000000

    print(f"ON YOUR ACCOUNT {hisob} MONEY AVAILABLE!")
    balancechiqish()


######################HISOB BALANSDAN CHIQISH MASALASI BO'YICHAAA#####################

def hisobchiqish():
    orqa = int(input("""
         __________                      _____________________
        | 1.ORQAGA |                    | 0.KARTANI CHIQARISH |
         ----------                      ---------------------
    
        KIRITING =>>   """))

    if orqa == 1:
        uzjarayon()
    elif orqa == 0:
        til()
    else:
        hisobchiqish()

def balanschiqish():
    orqa = int(input("""
         _________                      ________________
        | 1.НАЗАД |                    | 0.ВЫДАЧА КАРТЫ |
         ---------                      ----------------

        ВВЕДИТЕ =>>   """))

    if orqa == 1:
        rusjarayon()
    elif orqa == 0:
        til()
    else:
        balanschiqish()

def balancechiqish():
    orqa = int(input("""
         ________                      ____________________
        | 1.BACK |                    | 0.ISSUANCE OF CARD |
         --------                      --------------------

        ENTER =>>   """))

    if orqa == 1:
        enjarayon()
    elif orqa == 0:
        til()
    else:
        balancechiqish()
#################################    NAQD PUL   ########################################

def naqdpul():
    naqd = int(input("""
     ___________________                       ______________________
    |   1.  50,000      |                     |     5.  200,000      | 
     -------------------                       ----------------------
     
     ___________________                       ______________________
    |   2.  100,000     |                     |     6.  300,000      |
     -------------------                       ----------------------
    
     ___________________                       ______________________
    |   3.  150,000     |                     |     7.  400,000      |
     -------------------                       ----------------------
     
     ___________________                       ______________________
    |   4.BOSHQA SUMMA  |                     |     0.  ORQAGA       |
     -------------------                       ----------------------
                                                
                                               KIRITING =>>   """))
    pul = 10000000
    if naqd == 1:
        pul -= 50500
        som50()
    elif naqd == 2:
        pul -= 101000
        som100()
    elif naqd == 3:
        pul -= 151500
        som150()
    elif naqd == 4:
        boshqasumma()
    elif naqd == 5:
        pul -= 202000
        som200()
    elif naqd == 6:
        pul -= 303000
        som300()
    elif naqd == 7:
        pul -= 404000
        som400()




def naqddengi():
    naqd = int(input("""
     ___________________                       ______________________
    |   1.  50,000      |                     |     5.  200,000      | 
     -------------------                       ----------------------

     ___________________                       ______________________
    |   2.  100,000     |                     |     6.  300,000      |
     -------------------                       ----------------------

     ___________________                       ______________________
    |   3.  150,000     |                     |     7.  400,000      |
     -------------------                       ----------------------

     ___________________                       ______________________
    |   4.ДРУГАЯ СУММА  |                     |     0.  НАЗАД        |
     -------------------                       ----------------------

                                               ВВЕДИТЕ =>>   """))
    pul = 10000000
    if naqd == 1:
        pul -= 50500
        sum50()
    elif naqd == 2:
        pul -= 101000
        sum100()
    elif naqd == 3:
        pul -= 151500
        sum150()
    elif naqd == 4:
        drugoysumma()
    elif naqd == 5:
        pul -= 202000
        sum200()
    elif naqd == 6:
        pul -= 303000
        sum300()
    elif naqd == 7:
        pul -= 404000
        sum400()

def naqdmoney():
    naqd = int(input("""
     ___________________                       ______________________
    |   1.  50,000      |                     |     5.  200,000      | 
     -------------------                       ----------------------

     ___________________                       ______________________
    |   2.  100,000     |                     |     6.  300,000      |
     -------------------                       ----------------------

     ___________________                       ______________________
    |   3.  150,000     |                     |     7.  400,000      |
     -------------------                       ----------------------

     ___________________                       ______________________
    |  4.ANOTHER AMOUNT |                     |     5.  BACK         |
     -------------------                       ----------------------

                                               ENTER =>>   """))

################################   HISOB  KITOB   #####################################

def som50():
    som = int(input("""
    |______________________________      __________________|
    |        BERILGAN SUMMA:                50,000 UZS     |
    |------------------------------      ------------------|
    
    |______________________________      __________________|  
    |        KOMISSIYA:                     500 UZS        |
    |------------------------------      ------------------|
    
    |______________________________      __________________|
    |        YECHIB OLINGAN:                50,500 UZS     |
    |------------------------------      ------------------|
    
    _______________________________________________________
    
                                         __________________
                                        | 1.  TASDIQLASH   |
                                         ------------------   
                                         __________________
                                        | 0. BEKOR QILISH  |
                                         ------------------
    KIRITING =>>   """))

    if som == 1:
        print("""
        ____________________________________________
        | TO'LOV MUVAFFAQQIYATLI AMALGA OSHIRILDI: |
        | TO'LOV SUMMASI:   50,000  UZS            |
        | YECHIB OLINGAN SUMMA:  50,500  UZS       |
        |   ------------------------------------   |
        |  BANK:  XALQ BANKI                       |
        |  KARTA RAQAMI:  8600********9657         |
        |                                          |
        |  BALANS:  9,949,500  UZS                 |
        |__________________________________________|
        """)
        uzjarayon()
    elif som == 0:
        uzjarayon()
    else:
        som50()

def som100():
    som = int(input("""
    |______________________________      __________________|
    |        BERILGAN SUMMA:                100,000 UZS    |
    |------------------------------      ------------------|

    |______________________________      __________________|  
    |        KOMISSIYA:                     1,000 UZS      |
    |------------------------------      ------------------|

    |______________________________      __________________|
    |        YECHIB OLINGAN:                101,000 UZS    |
    |------------------------------      ------------------|

    _______________________________________________________

                                         __________________
                                        | 1.  TASDIQLASH   |
                                         ------------------   
                                         __________________
                                        | 0. BEKOR QILISH  |
                                         ------------------
    KIRITING =>>   """))

    if som == 1:
        print("""
        ____________________________________________
        | TO'LOV MUVAFFAQQIYATLI AMALGA OSHIRILDI: |
        | TO'LOV SUMMASI:   100,000  UZS           |
        | YECHIB OLINGAN SUMMA:  101,000  UZS      |
        |   ------------------------------------   |
        |  BANK:  XALQ BANKI                       |
        |  KARTA RAQAMI:  8600********9657         |
        |                                          |
        |  BALANS:  9,899,000  UZS                 |
        |__________________________________________|
        """)
        uzjarayon()
    elif som == 0:
        uzjarayon()
    else:
        som100()

def som150():
    som = int(input("""
    |______________________________      __________________|
    |        BERILGAN SUMMA:                150,000 UZS    |
    |------------------------------      ------------------|

    |______________________________      __________________|
    |        KOMISSIYA:                     1,500 UZS      |
    |------------------------------      ------------------|

    |______________________________      __________________|
    |        YECHIB OLINGAN:                101,500 UZS    |
    |------------------------------      ------------------|

    _______________________________________________________

                                         __________________
                                        | 1.  TASDIQLASH   |
                                         ------------------   
                                         __________________
                                        | 0. BEKOR QILISH  |
                                         ------------------
    KIRITING =>>   """))

    if som == 1:
        print("""
        ____________________________________________
        | TO'LOV MUVAFFAQQIYATLI AMALGA OSHIRILDI: |
        | TO'LOV SUMMASI:   150,000  UZS           |
        | YECHIB OLINGAN SUMMA:  151,500  UZS      |
        |   ------------------------------------   |
        |  BANK:  XALQ BANKI                       |
        |  KARTA RAQAMI:  8600********9657         |
        |                                          |
        |  BALANS:  9,848,500  UZS                 |
        |__________________________________________|
        """)
        uzjarayon()
    elif som == 0:
        uzjarayon()
    else:
        som150()

def som200():
    som = int(input("""
    |______________________________      __________________|
    |        BERILGAN SUMMA:                200,000 UZS    |
    |------------------------------      ------------------|

    |______________________________      __________________|  
    |        KOMISSIYA:                     2,000 UZS      |
    |------------------------------      ------------------|

    |______________________________      __________________|
    |        YECHIB OLINGAN:                202,000 UZS    |
    |------------------------------      ------------------|

    _______________________________________________________

                                         __________________
                                        | 1.  TASDIQLASH   |
                                         ------------------   
                                         __________________
                                        | 0. BEKOR QILISH  |
                                         ------------------
    KIRITING =>>   """))

    if som == 1:
        print("""
        ____________________________________________
        | TO'LOV MUVAFFAQQIYATLI AMALGA OSHIRILDI: |
        | TO'LOV SUMMASI:   200,000  UZS           |
        | YECHIB OLINGAN SUMMA:  202,000  UZS      |
        |   ------------------------------------   |
        |  BANK:  XALQ BANKI                       |
        |  KARTA RAQAMI:  8600********9657         |
        |                                          |
        |  BALANS:  9,798,000  UZS                 |
        |__________________________________________|
        """)
        uzjarayon()
    elif som == 0:
        uzjarayon()
    else:
        som200()

def som300():
    som = int(input("""
    |______________________________      __________________|
    |        BERILGAN SUMMA:                300,000 UZS    |
    |------------------------------      ------------------|
                                                
    |______________________________      __________________|   
    |        KOMISSIYA:                     3,000 UZS      |
    |------------------------------      ------------------|

    |______________________________      __________________|
    |        YECHIB OLINGAN:                303,000 UZS    |
    |------------------------------      ------------------|

    ________________________________________________________

                                         __________________
                                        | 1.  TASDIQLASH   |
                                         ------------------   
                                         __________________
                                        | 0. BEKOR QILISH  |
                                         ------------------
    KIRITING =>>   """))
    if som == 1:
        print("""
        ____________________________________________
        | TO'LOV MUVAFFAQQIYATLI AMALGA OSHIRILDI: |
        | TO'LOV SUMMASI:   300,000  UZS           |
        | YECHIB OLINGAN SUMMA:  303,000  UZS      |
        |   ------------------------------------   |
        |  BANK:  XALQ BANKI                       |
        |  KARTA RAQAMI:  8600********9657         |
        |                                          |
        |  BALANS:  9,697,000  UZS                 |
        |__________________________________________|
        """)
        uzjarayon()
    elif som == 0:
        uzjarayon()
    else:
        som50()

def som400():
    som = int(input("""
    |______________________________      __________________|
    |        BERILGAN SUMMA:                400,000 UZS    |
    |------------------------------      ------------------|

    |______________________________      __________________|   
    |        KOMISSIYA:                     4,000 UZS      |
    |------------------------------      ------------------|

    |______________________________      __________________|
    |        YECHIB OLINGAN:                404,000 UZS    |
    |------------------------------      ------------------|

    ________________________________________________________

                                         __________________
                                        | 1.  TASDIQLASH   |
                                         ------------------   
                                         __________________
                                        | 0. BEKOR QILISH  |
                                         ------------------
    KIRITING =>>   """))
    if som == 1:
        print("""
        ____________________________________________
        | TO'LOV MUVAFFAQQIYATLI AMALGA OSHIRILDI: |
        | TO'LOV SUMMASI:   400,000  UZS           |
        | YECHIB OLINGAN SUMMA:  404,000  UZS      |
        |   ------------------------------------   |
        |  BANK:  XALQ BANKI                       |
        |  KARTA RAQAMI:  8600********9657         |
        |                                          |
        |  BALANS:  9,596,000  UZS                 |
        |__________________________________________|
        """)
        uzjarayon()
    elif som == 0:
        uzjarayon()
    else:
        som400()

def boshqasumma():
    pul = 10000000
    boshqa = int(input("SUMMANI KIRITING =>>  "))
    foiz = boshqa/100
    ozgar = boshqa + (boshqa/100)
    jami = pul - ozgar

    som = int(input(f"""
    |______________________________      __________________|
    |        BERILGAN SUMMA:                {boshqa} UZS    
    |------------------------------      ------------------|

    |______________________________      __________________|   
    |        KOMISSIYA:                     {foiz} UZS    
    |------------------------------      ------------------|

    |______________________________      __________________|
    |        YECHIB OLINGAN:                {ozgar} UZS     
    |------------------------------      ------------------|

    ________________________________________________________

                                         __________________
                                        | 1.  TASDIQLASH   |
                                         ------------------   
                                         __________________
                                        | 0. BEKOR QILISH  |
                                         ------------------
    KIRITING =>>   """))
    if som == 1:
        print(f"""
        ____________________________________________
        | TO'LOV MUVAFFAQQIYATLI AMALGA OSHIRILDI: |
        | TO'LOV SUMMASI:   {boshqa}  UZS           
        | YECHIB OLINGAN SUMMA:  {ozgar}  UZS      
        |   ------------------------------------   |
        |  BANK:  XALQ BANKI                       |
        |  KARTA RAQAMI:  8600********9657         |
        |                                          |
        |  BALANS:  {jami}  UZS                 
        |__________________________________________|
        """)
        uzjarayon()
    elif som == 0:
        uzjarayon()
    else:
        boshqasumma()

############################################    rus pul   #######################################################

def sum50():
    som = int(input("""
    |______________________________      __________________|
    |        СУММА ПРЕДОСТАВЛЕНА:           50,000 UZS     |
    |------------------------------      ------------------|

    |______________________________      __________________|  
    |        КОМИССИЯ:                      500 UZS        |
    |------------------------------      ------------------|

    |______________________________      __________________|
    |        ВЫВЕДЕННАЯ СУММА:              50,500 UZS     |
    |------------------------------      ------------------|

    _______________________________________________________

                                         __________________
                                        | 1. ПОДТВЕРЖДЕНИЕ |
                                         ------------------   
                                         __________________
                                        | 0.    ОТМЕНА     |
                                         ------------------
    ВВЕДИТЕ =>>    """))
    if som == 1:
        print("""
        ____________________________________________
        | ПЛАТЕЖ ПРОЙДЕН УСПЕШНО:                  |
        | К ОПЛАТЕ:   50,000  UZS                  |
        | ВЫВЕДЕННАЯ СУММА:  50,500  UZS           |
        |   ------------------------------------   |
        |  БАНК:  XALQ BANKI                       |
        |  КАРТА:  8600********9657                |
        |                                          |
        |  БАЛАНС:  9,949,000  UZS                 |
        |__________________________________________|
        """)
        rusjarayon()
    elif som == 0:
        rusjarayon()
    else:
        sum50()
def sum100():
    som = int(input("""
    |______________________________      __________________|
    |        СУММА ПРЕДОСТАВЛЕНА:           100,000 UZS    |
    |------------------------------      ------------------|

    |______________________________      __________________|  
    |        КОМИССИЯ:                      1,000 UZS      |
    |------------------------------      ------------------|

    |______________________________      __________________|
    |        ВЫВЕДЕННАЯ СУММА:              101,000 UZS    |
    |------------------------------      ------------------|

    _______________________________________________________

                                         __________________
                                        | 1. ПОДТВЕРЖДЕНИЕ |
                                         ------------------   
                                         __________________
                                        | 0.    ОТМЕНА     |
                                         ------------------
    ВВЕДИТЕ =>>    """))
    if som == 1:
        print("""
        ____________________________________________
        | ПЛАТЕЖ ПРОЙДЕН УСПЕШНО:                  |
        | К ОПЛАТЕ:   101,000  UZS                 |
        | ВЫВЕДЕННАЯ СУММА:  101,000  UZS          |
        |   ------------------------------------   |
        |  БАНК:  XALQ BANKI                       |
        |  КАРТА:  8600********9657                |
        |                                          |
        |  БАЛАНС:  9,989,000  UZS                 |
        |__________________________________________|
        """)
        rusjarayon()
    elif som == 0:
        rusjarayon()
    else:
        sum100()
def sum150():
    som = int(input("""
    |______________________________      __________________|
    |        СУММА ПРЕДОСТАВЛЕНА:           150,000 UZS    |
    |------------------------------      ------------------|

    |______________________________      __________________|  
    |        КОМИССИЯ:                      1,500 UZS      |
    |------------------------------      ------------------|

    |______________________________      __________________|
    |        ВЫВЕДЕННАЯ СУММА:              151,500 UZS    |
    |------------------------------      ------------------|

    _______________________________________________________

                                         __________________
                                        | 1. ПОДТВЕРЖДЕНИЕ |
                                         ------------------   
                                         __________________
                                        | 0.    ОТМЕНА     |
                                         ------------------
    ВВЕДИТЕ =>>    """))
    if som == 1:
        print("""
        ____________________________________________
        | ПЛАТЕЖ ПРОЙДЕН УСПЕШНО:                  |
        | К ОПЛАТЕ:   150,000  UZS                 |
        | ВЫВЕДЕННАЯ СУММА:  151,500  UZS          |
        |   ------------------------------------   |
        |  БАНК:  XALQ BANKI                       |
        |  КАРТА:  8600********9657                |
        |                                          |
        |  БАЛАНС:  9,848,500  UZS                 |
        |__________________________________________|
        """)
        rusjarayon()
    elif som == 0:
        rusjarayon()
    else:
        sum150()
def sum200():
    som = int(input("""
    |______________________________      __________________|
    |        СУММА ПРЕДОСТАВЛЕНА:           200,000 UZS    |
    |------------------------------      ------------------|

    |______________________________      __________________|  
    |        КОМИССИЯ:                      2,000 UZS      |
    |------------------------------      ------------------|

    |______________________________      __________________|
    |        ВЫВЕДЕННАЯ СУММА:              202,000 UZS    |
    |------------------------------      ------------------|

    _______________________________________________________

                                         __________________
                                        | 1. ПОДТВЕРЖДЕНИЕ |
                                         ------------------   
                                         __________________
                                        | 0.    ОТМЕНА     |
                                         ------------------
    ВВЕДИТЕ =>>    """))
    if som == 1:
        print("""
        ____________________________________________
        | ПЛАТЕЖ ПРОЙДЕН УСПЕШНО:                  |
        | К ОПЛАТЕ:   200,000  UZS                 |
        | ВЫВЕДЕННАЯ СУММА:  202,000  UZS          |
        |   ------------------------------------   |
        |  БАНК:  XALQ BANKI                       |
        |  КАРТА:  8600********9657                |
        |                                          |
        |  БАЛАНС:  9,798,000  UZS                 |
        |__________________________________________|
        """)
        rusjarayon()
    elif som == 0:
        rusjarayon()
    else:
        sum200()
def sum300():
    som = int(input("""
    |______________________________      __________________|
    |        СУММА ПРЕДОСТАВЛЕНА:           200,000 UZS    |
    |------------------------------      ------------------|

    |______________________________      __________________|  
    |        КОМИССИЯ:                      2,000 UZS      |
    |------------------------------      ------------------|

    |______________________________      __________________|
    |        ВЫВЕДЕННАЯ СУММА:              202,000 UZS    |
    |------------------------------      ------------------|

    _______________________________________________________

                                         __________________
                                        | 1. ПОДТВЕРЖДЕНИЕ |
                                         ------------------   
                                         __________________
                                        | 0.    ОТМЕНА     |
                                         ------------------
    ВВЕДИТЕ =>>    """))
    if som == 1:
        print("""
        ____________________________________________
        | ПЛАТЕЖ ПРОЙДЕН УСПЕШНО:                  |
        | К ОПЛАТЕ:   300,000  UZS                 |
        | ВЫВЕДЕННАЯ СУММА:  303,000  UZS          |
        |   ------------------------------------   |
        |  БАНК:  XALQ BANKI                       |
        |  КАРТА:  8600********9657                |
        |                                          |
        |  БАЛАНС:  9,697,000  UZS                 |
        |__________________________________________|
        """)
        rusjarayon()
    elif som == 0:
        rusjarayon()
    else:
        sum300()
def sum400():
    som = int(input("""
    |______________________________      __________________|
    |        СУММА ПРЕДОСТАВЛЕНА:           400,000 UZS    |
    |------------------------------      ------------------|

    |______________________________      __________________|  
    |        КОМИССИЯ:                      4,000 UZS      |
    |------------------------------      ------------------|

    |______________________________      __________________|
    |        ВЫВЕДЕННАЯ СУММА:              404,000 UZS    |
    |------------------------------      ------------------|

    _______________________________________________________

                                         __________________
                                        | 1. ПОДТВЕРЖДЕНИЕ |
                                         ------------------   
                                         __________________
                                        | 0.    ОТМЕНА     |
                                         ------------------
    ВВЕДИТЕ =>>    """))
    if som == 1:
        print("""
        ____________________________________________
        | ПЛАТЕЖ ПРОЙДЕН УСПЕШНО:                  |
        | К ОПЛАТЕ:   400,000  UZS                 |
        | ВЫВЕДЕННАЯ СУММА:  404,000  UZS          |
        |   ------------------------------------   |
        |  БАНК:  XALQ BANKI                       |
        |  КАРТА:  8600********9657                |
        |                                          |
        |  БАЛАНС:  9,596,000  UZS                 |
        |__________________________________________|
        """)
        rusjarayon()
    elif som == 0:
        rusjarayon()
    else:
        sum400()
#########################  rus boshqa summa  ######################

def drugoysumma():
    pul = 10000000
    boshqa = int(input("ВВЕДИТЕ СУММУ =>>  "))
    foiz = boshqa/100
    ozgar = boshqa + (boshqa/100)
    jami = pul - ozgar
    som = int(input(f"""
        |______________________________      __________________|
        |        СУММА ПРЕДОСТАВЛЕНА:           {boshqa} UZS   
        |------------------------------      ------------------|

        |______________________________      __________________|  
        |        КОМИССИЯ:                      {foiz} UZS     
        |------------------------------      ------------------|

        |______________________________      __________________|
        |        ВЫВЕДЕННАЯ СУММА:              {ozgar} UZS    
        |------------------------------      ------------------|

        _______________________________________________________

                                             __________________
                                            | 1. ПОДТВЕРЖДЕНИЕ |
                                             ------------------   
                                             __________________
                                            | 0.    ОТМЕНА     |
                                             ------------------
        ВВЕДИТЕ =>>    """))
    if som == 1:
        print(f"""
            ____________________________________________
            | ПЛАТЕЖ ПРОЙДЕН УСПЕШНО:                  |
            | К ОПЛАТЕ:   {boshqa}  UZS                 
            | ВЫВЕДЕННАЯ СУММА:  {ozgar}  UZS          
            |   ------------------------------------   |
            |  БАНК:  XALQ BANKI                       |
            |  КАРТА:  8600********9657                |
            |                                          |
            |  БАЛАНС:  {jami}  UZS                 
            |__________________________________________|
            """)
        rusjarayon()
    elif som == 0:
        rusjarayon()
    else:
        drugoysumma()





if __name__ == "__main__":
    til()
